# 1)Дано list:#   list = [22, 3,5,2,8,2,-23, 8,23,5]#   - знайти min число в list#   - видалити всі дублікати в list#   - замінити кожне четверти значення на "Х"# 2) вивести на екран пустий квадрат з "*" сторона якого вказана в змінній:# 3) вивести табличку множення з допомогою цикла while# 4) переробити перше завдання під меню з допомогою цикла## ***  - вивести елемент lst, значення якого ближче всього до середнього арифметического всіх елементів цього же list## [1, 2, 3, 4, 5, 6, 7, 8, 9] => 5# [-1, -2, 3, 4, 555] => 4# [5, 5, 5, 5] => 5# [-10, 5, 5] => 5# 1# expList = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]# minN = 0# for i in expList:#     if i < minN:#         minN = i# print minN# newList = set(expList)# print(newList)# for i in range(3, len(expList), 4):#     expList[i] = 'X'# print(expList)# 2# n = 5# for i in range(n):#     for j in range(n):#         if i == 0 or j == 0 or i == n - 1 or j == n - 1:#             print("#", end="")#         else:#             print(" ", end="")#     print("")# 3# i = 1# while i <= 10:#     j = 1#     while j <= 10:#         print(j * i, end=' ')#         j += 1#     i += 1#     print()# 4# while True:#     expList = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]#     print('1. Знайти min число в list')#     print('2. Видалити всі дублікати в list')#     print('3. Замінити кожне четверти значення на "X"')#     print('4. Завершити')##     num = int(input("Виберіть пункт: "))#     if num == 1:#         minN = 0#         for i in expList:#             if i < minN:#                 minN = i#         print(minN)#     elif num == 2:#         newList = set(expList)#         print(newList)#     elif num == 3:#         for i in range(3, len(expList), 4):#             expList[i] = 'X'#         print(expList)#     elif num == 4:#         break